tutorials/incompressible/MRFPorousFoam/mixerGgiMRFCoupled/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="MRFPorousFoam"

runApplication blockMesh
\cp -f boundary constant/polyMesh/boundary
runApplication regionCellSets
runApplication setSet -batch setBatch.batch
\rm -f constant/polyMesh/sets/cellRegion*
runApplication setsToZones -noFlipMap
runApplication $application
